---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.Dispose
source: html/4b5ae35b-9ed3-697a-75c3-b9418f17ebd4.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.Dispose Method

Releases all resources used by the ColorWithTransparency

## Syntax (C#)
```csharp
public void Dispose()
```